/* TCError.requestConstructionError description */
"error_constructing_the_request" = "Error constructing the request";

/* TCError.decodingError description */
"error_decoding_data_from_the_server" = "Error decoding data from the server";

/* noData.decodingError description */
"error_retrieving_data_from_the_server" = "Error retrieving data from the server";

/* TCError.requestReturnedEmpty description */
"no_items_found" = "No items found";

/* TCError.noNetwork description */
"no_network_connection" = "No network connection";

/* ListStatus.noItemsReturned description */
"no_results_were_returned_for_this_item" = "No results were returned for this item";

/* ListStatus.noNetwork description */
"please_check_your_connection" = "Please check your connection";

/* TCError.emptyInput description */
"search_is_empty" = "Search is empty";

/* The search input field placeholder */
"search_drinks" = "Search cocktails";

/* ListStatus.loadingData description */
"searching" = "searching";

/* ListStatus.awaitingInput description */
"use_the_input_field_above_to_search_for_drinks" = "Use the input field above to search for cocktails";

/* text for search button */
"search" = "Search";

/* ProductList main title */
"drink_search" = "Cocktail Search";

/* Author label text for missing */
"author_not_known" = "author not known";

/* accessibility Label for status view label*/
"current_status_label" = "Current Status Text";

/* accessibility Label for product title label*/
"product_title_label" = "Product title";
